test/tests/variables/foam_htc_fluid/foam/0/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 0.1;

boundaryField
{
    left
    {
        type            calculated;
        value           uniform 0.;
    }
    right
    {
        type            calculated;
        value           uniform 0.;
    }
    top
    {
        type            calculated;
        value           uniform 0.;
    }
    bottom
    {
        type            calculated;
        value           uniform 0.;
    }
    back
    {
        type            calculated;
        value           uniform 0.;
    }
    front
    {
        type            calculated;
        value           uniform 0.;
    }
}


// ************************************************************************* //
